# Creating DataFrame

In [2]:
import numpy as np
import pandas as pd
dict1 = {
    "name":['sachin','aashish','rohan'],
    "marks":[80,84,83],
    "city":['alwar','delhi','kolkata']
}
df=pd.DataFrame(dict1)
df

      name  marks     city
0   sachin     80    alwar
1  aashish     84    delhi
2    rohan     83  kolkata

# Exporting to csv

In [3]:
df.to_csv('friends.csv')

In [4]:
df.head(2)

      name  marks   city
0   sachin     80  alwar
1  aashish     84  delhi

In [5]:
df.tail(2)

      name  marks     city
1  aashish     84    delhi
2    rohan     83  kolkata

In [7]:
df.describe()

           marks
count   3.000000
mean   82.333333
std     2.081666
min    80.000000
25%    81.500000
50%    83.000000
75%    83.500000
max    84.000000

# Reading csv

In [8]:
train = pd.read_csv('train.csv')

In [9]:
train

   Train no  speed     city
0     12322     95    alwar
1     12931    110  mathura
2     33221     99   mumbai
3     11344    310    delhi

In [10]:
train['speed']

0     95
1    110
2     99
3    310
Name: speed, dtype: int64

In [11]:
train['city']

0      alwar
1    mathura
2     mumbai
3      delhi
Name: city, dtype: object

# Changing Index

In [13]:
train.index=['first','second','third','fourth']
train

        Train no  speed     city
first      12322     95    alwar
second     12931    110  mathura
third      33221     99   mumbai
fourth     11344    310    delhi

# Generating randomn series

In [8]:
import pandas as pd
import numpy as np
ser = pd.Series(np.random.rand(10))
type(ser)

pandas.core.series.Series

# creating dataframe

In [20]:
newdf = pd.DataFrame(np.random.rand(5,5),index=np.arange(5))
#newdf[4][4]='sachin'
newdf

          0         1         2         3         4
0  0.057607  0.002362  0.956498  0.581191  0.829674
1  0.478591  0.583865  0.396993  0.659576  0.269027
2  0.159828  0.688169  0.138797  0.711369  0.444747
3  0.858461  0.791466  0.371227  0.033623  0.751884
4  0.218177  0.687451  0.005171  0.491297  0.644819

In [21]:
newdf.describe()

              0         1         2         3         4
count  5.000000  5.000000  5.000000  5.000000  5.000000
mean   0.354533  0.550662  0.373737  0.495411  0.588030
std    0.321715  0.315175  0.364416  0.271206  0.229542
min    0.057607  0.002362  0.005171  0.033623  0.269027
25%    0.159828  0.583865  0.138797  0.491297  0.444747
50%    0.218177  0.687451  0.371227  0.581191  0.644819
75%    0.478591  0.688169  0.396993  0.659576  0.751884
max    0.858461  0.791466  0.956498  0.711369  0.829674

In [22]:
newdf.columns

RangeIndex(start=0, stop=5, step=1)

# conversion to numpy array

In [24]:
newdf.to_numpy()

array([[0.057607  , 0.00236183, 0.95649794, 0.58119108, 0.82967425],
       [0.47859064, 0.58386515, 0.39699273, 0.65957557, 0.26902661],
       [0.15982818, 0.68816861, 0.13879739, 0.71136937, 0.44474703],
       [0.85846132, 0.79146598, 0.37122741, 0.03362306, 0.75188366],
       [0.21817665, 0.68745054, 0.00517134, 0.49129685, 0.64481912]])

In [27]:
newdf[0]

0    0.057607
1    0.478591
2    0.159828
3    0.858461
4    0.218177
Name: 0, dtype: float64

In [29]:
newdf2=newdf.copy()
newdf2

          0         1         2         3         4
0  0.057607  0.002362  0.956498  0.581191  0.829674
1  0.478591  0.583865  0.396993  0.659576  0.269027
2  0.159828  0.688169  0.138797  0.711369  0.444747
3  0.858461  0.791466  0.371227  0.033623  0.751884
4  0.218177  0.687451  0.005171  0.491297  0.644819

In [32]:
newdf2.columns=list("abcde")
newdf2

          a         b         c         d         e
0  0.057607  0.002362  0.956498  0.581191  0.829674
1  0.478591  0.583865  0.396993  0.659576  0.269027
2  0.159828  0.688169  0.138797  0.711369  0.444747
3  0.858461  0.791466  0.371227  0.033623  0.751884
4  0.218177  0.687451  0.005171  0.491297  0.644819

In [33]:
newdf.sort_index(axis=1,ascending=False)

          4         3         2         1         0
0  0.829674  0.581191  0.956498  0.002362  0.057607
1  0.269027  0.659576  0.396993  0.583865  0.478591
2  0.444747  0.711369  0.138797  0.688169  0.159828
3  0.751884  0.033623  0.371227  0.791466  0.858461
4  0.644819  0.491297  0.005171  0.687451  0.218177

In [34]:
type(newdf)

pandas.core.frame.DataFrame

# copying data from dataframe to another dataframe

In [36]:
newdf2=newdf.copy()
newdf